<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"eede8b11a0d58cca453399047770f043292603d639ad90f6298499fc6d42fd53","plan_job_ref":"Job Test terraform-refresh #45 at https://github.com/dflook/terraform-github-actions/actions/runs/15351156066","plan_out_hash":"da7d2a71a94657f9f6ff5e28d0cfcd385f8f3fd43ee647bb4fbabc16cb3e9daf","plan_hash":"97d56a3409163369da3fff5e45648bb2d3003f8540af0e7c6ed94deb48b55601","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #45](https://github.com/dflook/terraform-github-actions/actions/runs/15351156066)